package KI305.Dzera.Lab6;

/**
 * Інтерфейс CargoItem визначає методи, які повинні бути реалізовані об'єктами,
 * які представляють товар в системі зберігання суднового трюму.
 */
public interface CargoItem {

    /**
     * Метод, який повертає об'єм товару.
     *
     * @return об'єм товару в кубічних метрах
     */
    int getVolume();

    /**
     * Метод, який виводить інформацію про товар.
     * Реалізація цього методу повинна виводити назву товару та його об'єм.
     */
    void displayInfo();
}